web-a/app/controllers/top_controller.rb

  def index
    user = User.find_by(id: 1)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1