api/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5
---
  def destroy
    post = Post.find_by(id: params[:id])

    if post
      post.destroy!